app/Models/ClimaModel.php

    public function getUbicaciones(){
    $db      = db_connect();
        $builder = $db->table('clima')
                    ->select('ubicacion')
                    ->groupBy('ubicacion');

        $query = $builder->get();
---
SELECT `ubicacion`
FROM `clima`
GROUP BY `ubicacion`